{
  "title":"Red Pepper",
  "color_code":"#c61524",
  "logo":"url",
  "pages": {
      "first_page": {
          "image": "url"
      },
      "wiki": {
          "description": "The chili pepper (also chile pepper chilli pepper, or simply chilli) is the fruit of plants from the genus Capsicum, members of the nightshade family, Solanaceae. They are widely used in many cuisines to add spiciness to dishes. The substances that give chili peppers their intensity when ingested or applied topically are capsaicin and related compounds known as capsaicinoids.\n\nChili pepper pods, which are berries, are used fresh or dried. Chilies are dried to preserve them for long periods of time, which may also be done by pickling.\n\nDried chilies are often ground into powders, although many Mexican dishes including variations on chiles rellenos use the entire chili. Dried whole chilies may be reconstituted before grinding to a paste. The chipotle is the smoked, dried, ripe jalapeño.",
          "link_url": "wiki_url"
      },
      "images": {
          "large": "img_url",
          "small": "img_url",
          "link_url": "img_link_url"
      },
      "recipe": {
          "ingredients": "2 teaspoons olive oil\n125g rindless bacon\n750g lean beef mince\n2 medium brown onions\n2 medium red capsicums\n3 garlic cloves\n1 long red chili pepper\n2 tablespoons Mexican chili powder\n800g can chopped tomatoes\n400g can red kidney beans",
          "image": "url",
          "steps": "1. Heat oil in a large saucepan over medium heat. Add bacon. Cook for 5 to 6 minutes or until crisp. Add mince. Cook, stirring with a wooden spoon to break up mince, for 15 minutes or until browned.\n\n2. Add onions, capsicums, garlic and chopped chilli. Cook for 5 to 6 minutes or until vegetables are soft. Add chilli powder. Cook, stirring, for 1 minute or until fragrant.\n\n3. Add tomatoes and 1 cup cold water. Bring to the boil. Reduce heat to mediumlow. Simmer, partially covered, for 30 minutes or until sauce has reduced slightly.\n\n4. Add beans. Increase heat to medium. Cook for 15 minutes or until beans are heated through and sauce has thickened. Serve chilli with toppings.",
          "link_url": "http://www.taste.com.au/recipes/chilli-con-carne-10/16d484bb-df3d-4069-bbb9-ea5856407344"
      }
  }
}
